---
kind: method
id: M:Autodesk.Revit.DB.CitySet.Insert(Autodesk.Revit.DB.City)
source: html/e39bee84-af20-4a99-a3f6-7822c413ad47.htm
---
# Autodesk.Revit.DB.CitySet.Insert Method

Insert the specified city into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	City item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.City`) - The city to be inserted into the set.

## Returns
Returns whether the city was inserted into the set.